blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "article 2"], ["text", "text article"], ["created_at", "2019-12-08 12:00:19.451561"], ["updated_at", "2019-12-08 12:00:19.451561"]]
---
 def create
  # render plain: params[:article].inspect
  @article = Article.new(article_params)

  if @article.save